project_backend/app/controllers/games_controller.rb

    def create
        game = Game.create
        user1 = User.find_by(name:params["user1"])
        user2 = User.find_by(name:params["user2"])
---
INSERT INTO "games" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-01-27 02:11:34.256997"], ["updated_at", "2021-01-27 02:11:34.256997"]]
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "dana"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "shreya"], ["LIMIT", 1]]